Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 128, 16)           21904     
_________________________________________________________________
dense (Dense)                (None, 128, 16)           272       
_________________________________________________________________
activation (Activation)      (None, 128, 16)           0         
=================================================================
Total params: 22,176
Trainable params: 22,176
Non-trainable params: 0
_________________________________________________________________
