Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512, 1)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 16)                21840     
_________________________________________________________________
dense (Dense)                (None, 32)                544       
_________________________________________________________________
activation (Activation)      (None, 32)                0         
=================================================================
Total params: 22,384
Trainable params: 22,384
Non-trainable params: 0
_________________________________________________________________
