Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 1)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 16)                21840     
_________________________________________________________________
dense (Dense)                (None, 16)                272       
_________________________________________________________________
activation (Activation)      (None, 16)                0         
=================================================================
Total params: 22,112
Trainable params: 22,112
Non-trainable params: 0
_________________________________________________________________
