Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 16)                21904     
_________________________________________________________________
dense (Dense)                (None, 5)                 85        
=================================================================
Total params: 21,989
Trainable params: 21,989
Non-trainable params: 0
_________________________________________________________________
