Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru (GRU)                    (None, 256, 128)          51840     
_________________________________________________________________
time_distributed (TimeDistri (None, 256, 5)            645       
_________________________________________________________________
lambda (Lambda)              (None, 1, 5)              0         
=================================================================
Total params: 52,485
Trainable params: 52,485
Non-trainable params: 0
_________________________________________________________________
