{"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 640, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_10", "trainable": true, "dtype": "float32", "nb_filters": 64, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": false, "activation": "linear", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_10", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["tcn_10", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "output_layers": [["dense_8", 0, 0]]}