Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 6)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 128, 16)           21920     
_________________________________________________________________
dense (Dense)                (None, 128, 6)            102       
_________________________________________________________________
activation (Activation)      (None, 128, 6)            0         
=================================================================
Total params: 22,022
Trainable params: 22,022
Non-trainable params: 0
_________________________________________________________________
