Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 256, 16)           14544     
_________________________________________________________________
time_distributed (TimeDistri (None, 256, 5)            85        
=================================================================
Total params: 14,629
Trainable params: 14,629
Non-trainable params: 0
_________________________________________________________________
