Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 256, 32)           108096    
_________________________________________________________________
time_distributed (TimeDistri (None, 256, 5)            165       
=================================================================
Total params: 108,261
Trainable params: 108,261
Non-trainable params: 0
_________________________________________________________________
