{"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [128, 2560, 1], "dtype": "float32", "sparse": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_6", "trainable": true, "dtype": "float32", "nb_filters": 64, "kernel_size": 2, "nb_stacks": 1, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": false, "activation": "linear", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_6", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["tcn_6", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_5", 0, 0]]}