Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 16)                18224     
_________________________________________________________________
dense (Dense)                (None, 1)                 17        
=================================================================
Total params: 18,241
Trainable params: 18,241
Non-trainable params: 0
_________________________________________________________________
