Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 256, 16)           18224     
_________________________________________________________________
time_distributed (TimeDistri (None, 256, 5)            85        
_________________________________________________________________
lambda (Lambda)              (None, 256, 5)            0         
=================================================================
Total params: 18,309
Trainable params: 18,309
Non-trainable params: 0
_________________________________________________________________
