Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 128, 5)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 128, 16)           21904     
_________________________________________________________________
time_distributed (TimeDistri (None, 128, 5)            85        
_________________________________________________________________
lambda (Lambda)              (None, 1, 5)              0         
=================================================================
Total params: 21,989
Trainable params: 21,989
Non-trainable params: 0
_________________________________________________________________
