{"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 5], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 2, "dilations": [1, 2, 4, 8, 16, 32], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.05, "return_sequences": true, "activation": "linear", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxoAAAB8AGQAZACFAmQAiACFAmQAZACFAmYDGQBTACkBTqkA\nKQHaAXgpAdoLbGVuZ3RoX3ByZWRyAQAAAPo3L2hvbWUvdG1hcmN1L2JyYWluMmJyYWluL2JyYWlu\nMmJyYWluL3Rjbl9leHBlcmltZW50cy5wedoIPGxhbWJkYT4YAQAA8wAAAAA=\n", null, [1]], "function_type": "lambda", "module": "brain2brain.tcn_experiments", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda", 0, 0]]}