{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 114], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn", "trainable": true, "dtype": "float32", "nb_filters": 32, "kernel_size": 4, "nb_stacks": 2, "dilations": [1, 2, 4, 8, 16], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.05, "return_sequences": true, "activation": "linear", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["tcn", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxwAAAB8AGQAZACFAnQACwBkAIUCZABkAIUCZgMZAFMAKQFO\nKQHaC2xlbmd0aF9wcmVkKQHaAXipAHIDAAAA+h48aXB5dGhvbi1pbnB1dC04LWI5YTk3NTRkYTZi\nMz7aCDxsYW1iZGE+EQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}