Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 512, 1)]          0         
_________________________________________________________________
tcn (TCN)                    (None, 512, 16)           21840     
_________________________________________________________________
dense (Dense)                (None, 512, 1)            17        
_________________________________________________________________
activation (Activation)      (None, 512, 1)            0         
=================================================================
Total params: 21,857
Trainable params: 21,857
Non-trainable params: 0
_________________________________________________________________
